# 학번 입력받고 학년, 학과, 반, 번호 출력

st_n = input("학번을 입력하시오 : ")

# if st_n[0]=='1' or st_n[0]=='2':
#   if st_n[1]=='1' or st_n[1]=='2':
#     print("뉴미디어소프트웨어과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   elif st_n[1]=='3' or st_n[1]=='4':
#     print("뉴미디어웹솔루션과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   elif st_n[1]=='5' or st_n[1]=='6':
#     print("뉴미디어디자인과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   else:
#     print("존재하지 않는 학번입니다. 다시 실행해주세요.")

# elif st_n[0]=='3':
#   if st_n[1]=='1' or st_n[1]=='2':
#     print("인터랙티브미디어과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   elif st_n[1]=='3' or st_n[1]=='4':
#     print("뉴미디어디자인과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   elif st_n[1]=='5' or st_n[1]=='6':
#     print("뉴미디어솔루션과 "+st_n[0]+"학년 "+st_n[1]+"반 "+st_n[2:]+"번")
#   else:
#     print("존재하지 않는 학번입니다. 다시 실행해주세요.")

# else:
#   print("존재하지 않는 학번입니다. 다시 실행해주세요.")

major = [["뉴미디어소프트웨어과", "뉴미디어웹솔루션과", "뉴미디어디자인과"],
         ["뉴미디어소프트웨어과", "뉴미디어웹솔루션과", "뉴미디어디자인과"],
         ["인터랙티브미디어과", "뉴미디어디자인과", "뉴미디어솔루션과"]]

grade = int(st_n[0])
classroom = int(st_n[1])
stuNum = int(st_n[2:])

print(grade, "학년", major[grade-1][(classroom-1)//2], classroom, "반", stuNum, "번입니다.")